{
    "home_text": "Welcome to my portfolio. I am an aspiring software engineer, equipped with coding skills and a passion for problem-solving. I am seeking opportunities to make a meaningful impact and grow in a collaborative tech environment. Feel free to browse through my projects and contact me if you have any questions.",

    "home_roles": [
        "Network Engineer",
        "C Programmer",
        "Java Programmer",
        "Machine Learning",
        "Web Developer",
        "Android App Developer",
        "Cybersecurity Enthusiast",
        "Assembly Level Programmer",
        "C#/.NET Development",
        "Microsoft Office"
    ],   

    "about_data": {
        "Technical Skills": [
            "Machine Learning",
            "Android App Development",
            "Web Development",
            "Data Science",
            "C#/.NET",
            "Assembly Level Programming",
            "Microsoft Word",
            "Microsoft Excel",
            "Microsoft Powerpoint",
            "Cloud Deployment"
        ],
        "Programming Languages": [
            "C",
            "Python",
            "Java",
            "C++",
            "C#",
            "Javascript",
            "SQL"
        ],
        "Frameworks": [
            "Numpy",
            "Pandas",
            "Scikit-learn",
            "Django",
            "Flask",
            "Bootstrap"
        ],
        "Platforms and Tools": [
            "MS Office",
            "Power BI",
            "Visual Studio Code",
            "Android Studio",
            "Microsoft Visual Studio",
            "GitHub",
            "Amazon Web Services",
            "Cisco Packet Tracer",
            "Amazon AWS"
        ],
        "Languages known": [
            "English",
            "Hindi",
            "Bengali",
            "Assamese",
            "French",
            "Japanese",
            "Arabic"
        ]
    },

    "about_text": [
        "Welcome to my portfolio website! I'm thrilled to have you here and share my journey as a Computer Science Engineering fresher. With a passion for technology and innovation, I've dedicated myself to honing my coding and problem-solving skills, and I'm excited to showcase my work and projects.",

        "My journey has not only been about technical prowess but also about personal growth. I bring to the table a strong sense of determination, adaptability, and a keen eye for detail. These qualities have allowed me to navigate complex projects, overcome challenges, and consistently deliver exceptional results. Furthermore, my collaboration skills enable me to work seamlessly in teams and ensure the effective conveyance of ideas and solutions.",

        "In the realm of technology, my skill set is robust and constantly evolving. Proficient in a variety of programming languages such as Python, Java, C, and C++, I have a deep understanding of software development, data structures, machine learning, and computer networks. My expertise extends to assembly level programming, web development, and mobile application development, making me a versatile contributor to a wide range of tech-related projects.",

        "As an introvert, I excel in introspection, which allows me to delve deeply into complex technical challenges and meticulously analyze potential solutions. This inclination towards solitude also provides me with a natural proclivity for focus and a keen attention to detail. It's a quality that not only complements my technical skills but also underscores my dedication to delivering precise and well-thought-out results. In a world that often values extroverted qualities, I've found that my introverted nature to be an asset, enabling me to bring a different dimension to my work and problem-solving processes.",

        "By exploring the projects showcased on this website, you'll gain firsthand insight into the depth of my technical skills and how they have been applied to solve real-world challenges. As you explore these pages, you'll find a collection of my best coding projects, a glimpse into my problem-solving process, and a little insight into the person behind the code. I invite you to explore, be inspired, and get in touch for any inquiry or collaboration. Your visit is appreciated, and I trust you'll find your time here both engaging and enlightening."
    ],

    "experiences": [
        {
            "role": "Machine Learning Intern",
            "company": "CodSoft",
            "duration": "August 2023 - September 2023",
            "description": [
                "Worked on various projects related to machine learning, including:"
            ],
            "bullets": [
                "Data preprocessing and analysis",
                "Machine learning algorithms",
                "Deep learning models",
                "Natural language processing"
            ]
        },

        {
            "role": "Network Engineering Intern",
            "company": "Cisco Netacad",
            "duration": "May 2022 - July 2022",
            "description": [
                "Working on various projects related to networking, including:"
            ],
            "bullets": [
                "Network design and implementation",
                "Configuration and troubleshooting",
                "Network troubleshooting and maintenance",
                "Network troubleshooting and maintenance"
            ]
        }
    ],

    "educations": [
        {
            "degree": "Bachelor of Technology",
            "subject": "Computer Science",
            "institute": "Delhi Technical Campus",
            "university": "Guru Gobind Singh Indraprastha University",
            "duration": "2020-2024",
            "score1": "CGPA: 8.7",
            "bullets":[
                "Achieved first place in the Project Open Day for my project 'Cyphercraft.'",
                "Published multiple research papers in reputed journals in fields such as Cybersecurity and Machine Learning over a four-year period.",
                "Successfully qualified for the GATE exam in both attempts.",
                "Attained a 95.27 percentile in the CAT exam in 2023."
            ]
        },

        {
            "degree": "Higher Secondary",
            "subject": "Science",
            "institute": "St. Dominic Savio College",
            "university": "CISCE",
            "duration": "2019",
            "score1": "ISC (2019): 86.5%",
            "score2": "ICSE (2017): 89.2%",
            "bullets":[
                "Consistently excelled in various competitions, receiving numerous accolades that demonstrate my commitment to excellence and ability to thrive in high-pressure environments.",
                "Served as Head of the Editorial Board at my school during the academic year 2018-2019.",
                "Achieved a notable milestone by ranking 12th at the National Level of the Wiz National Spelling Bee in 2015."
            ]
        }
    ],

    "projects": [

        {
            "name": "Blogzilla",
            "tech": [
                "Python",
                "Flask",
                "PostgreSQL",
                "JWT",
                "HTML",
                "CSS",
                "Bootstrap"
            ],
            "short_description": "A web application built using Flask and PostgreSQL that allows users to create, read, update, and delete blog posts with an efficient and user-friendly interface.",
            "description": "This project is a full-featured blogging platform built using the Flask framework and PostgreSQL for database management. It provides users with essential functionalities such as user registration, authentication, profile management, post creation, commenting, and more. The application also includes security features like JWT-based password reset tokens.",
            "bullets": [
                "User registration and authentication.",
                "Profile management with the ability to set profile pictures.",
                "Post management: create, update, and delete blog posts.",
                "Commenting system: write and delete comments on blog posts.",
                "JWT-based password reset mechanism for secure account recovery."
            ],
            "github":"https://github.com/debachow-007/BlogZilla",
            "link": "#",
            "images": [
                "project71.jpg",
                "project72.jpg",
                "project73.jpg",
                "project74.jpg"
            ]
        },

        {
            "name": "Tweetocracy",
            "tech": [
                "Machine Learning",
                "Python",
                "Flask",
                "Pandas",
                "Numpy",
                "Support Vector Machine",
                "Scikit-learn",
                "VADER",
                "Tweepy",
                "Jupyter Notebook",
                "OPENAI GPT 3.5",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "short_description": "A machine learning project that predicts whether a tweet is positive or negative based on its sentiment score.",
            "description": "This web application is a Flask-based project designed to provide two main functionalities related to the Lok Sabha elections 2024. The first functionality focuses on sentiment analysis of recent tweets, while the second functionality offers an interactive chatbot powered by GPT-3.5, which is informed by party manifestos from different political parties.",
            "bullets": [
                "Search word functionality for sentiment analysis of recent tweets.",
                "Ensemble sentiment analyzer using VADER and SVM model trained on 2019 election tweet data.",
                "Visual representation of sentiment analysis results using pie charts and bar graphs.",
                "Chatbot powered by GPT-3.5, informed by party manifestos from different political parties.",
                "Interactive Q&A feature to ask questions about promises made by various parties and receive relevant answers."
            ],
            "github":"https://github.com/debachow-007/Tweetocracy",
            "images": [
                "project61.jpg",
                "project62.jpg",
                "project63.jpg"
            ]
        },

        {
            "name": "Cyphercraft",
            "tech": [
                "Android",
                "Java",
                "XML",
                ".NET",
                "C#",
                "Android Studio",
                "Visual Studio"
            ],
            "short_description": "An Android application for file encryption using Rijndael Encryption. The app encrypts files and transfers the encryption key to a PC. The PC stores the key and can retrieve it later for decryption on the phone.",
            "description": "Cyphercraft is an advanced file security application designed to encrypt files using Rijndael Encryption. Developed as an Android application, it features a robust mechanism for transferring encryption keys to a PC. The PC stores these keys securely, allowing users to retrieve them later for decryption on their phones. The application ensures high-level security with the inclusion of a fingerprint lock and PIN system.",
            "bullets": [
                "User functionalities: file selection for encryption, deletion of files and their keys, key retrieval from PC for decryption.",
                "Encryption and padding of files before secure transfer to PC.",
                "Fingerprint lock and PIN system for security.",
                "Data encryption and decryption using Rijndael encryption.",
                "Secure key transfer using Bluetooth.",
                "Awarded the best project in college",
                "Published a research paper detailing the implementation and results. DTC Journal of Computational Intelligence, Vol-2, Issue-2, December 2023"
            ],
            "github":"https://github.com/debachow-007/CypherCraft",
            "images": [
                "project51.jpg",
                "project52.jpg"
            ]
        },

        {
            "name": "Movie Genre Classification",
            "tech": [
                "Python",
                "Numpy",
                "Pandas",
                "Scikit-learn",
                "Jupyter Notebook"
            ],
            "short_description": "A machine learning project focused on classifying movie genres based on movie titles and summaries using Random Forest Classification",
            "description": "A machine learning project focused on classifying movie genres based on movie titles and summaries using Random Forest Classification",
            "bullets": [    
                "Data preprocessing: Cleaned and tokenized text data, removed stop words, applied tfidf transformation.",
                "TF-IDF is used for text preprocessing and classification.",
                "Dataset used: IMDb",
                "Achieved an accuracy of 86%",
                "Challenges: Handling a large and imbalanced dataset."
            ],
            "github": "https://github.com/debachow-007/MovieGenreClassification",
            "images": [
                "project41.jpg",
                "project42.jpg"
            ]
        },

        {
            "name": "Credit Card Fraud Detection",
            "tech": [
                "Python",
                "Numpy",
                "Pandas",
                "Scikit-learn",
                "Jupyter Notebook"
            ],
            "short_description": "A data science project aimed at detecting fraudulent credit card transactions using decision tree algorithms.",
            "description": "A data science project aimed at detecting fraudulent credit card transactions using decision tree algorithms.",
            "bullets": [
                "Data Preprocessing: Handled missing values, normalized transaction amounts, encoded categorical variables.",
                "Decision Tree Algorithm is used for classification.",
                "Dataset used: Credit card transaction data",
                "Achieved an accuracy of 99.57%",
                "Challenges: Dealing with imbalanced data."
            ],
            "github": "https://github.com/debachow-007/CreditCardFraud",
            "images": [
                "project31.jpg",
                "project32.jpg"
            ]
        },

        {
            "name": "Customer Churn Prediction",
            "tech": [
                "Python",
                "Numpy",
                "Pandas",
                "Scikit-learn",
                "Jupyter Notebook"
            ],
            "short_description": "A project to predict customer churn in a banking dataset using Random Forest algorithms.",
            "description": "A project to predict customer churn in a banking dataset using Random Forest algorithms.",
            "bullets": [
                "Data Preprocessing: Handled missing values, encoded categorical variables, scaled numerical features.",
                "Gained insights into feature importance and customer retention strategies.",
                "Dataset used: Banking data",
                "Achieved an accuracy of 86.75%"
            ],
            "github": "https://github.com/debachow-007/CustomerChurnPrediction",
            "images": [
                "project21.jpg",
                "project22.jpg"
            ]
        },

        {
            "name": "Packet Flow Visualizer",
            "tech": [
                "Cisco Packet Tracer",
                "Computer Networks"
            ],
            "short_description": "A network topology for a college network using Cisco Packet Tracer, with packet collection and analysis at each device using sniffers.",
            "description": "This project focuses on creating a network topology for a college and collecting packets at each device using a packet sniffer. The project is divided into two main objectives: creating a suitable network topology and collecting packets for analysis.",
            "bullets": [
                "Network divided into four parts: CS Lab, Library, Board Room, and Director's Office.",
                "IP addressing scheme using subnet with network ID 192.168.10.0/26.",
                "Devices connected within LANs using switches.",
                "Inter-LAN connectivity established using routers with RIPv2 protocol.",
                "Packet sniffers placed to capture and analyze packets from various nodes.",
                "Analysis of Ethernet and IP header changes in captured packets."
            ],
            "github": "https://github.com/debachow-007/cisco_cybersecurity",
            "images": [
                "project11.jpg"
            ]
        }
    ],
    
    "hobbies": [
        {
            "name": "Writing",
            "description": [
                "Writing has been my passion since a young age. I vividly remember filling countless notebooks with stories and poems, each one a new adventure. One of my proudest achievements is completing my novel, \"The Room of Death\", which is soon to be published. The process of crafting this story was a journey in itself, filled with late-night writing sessions and countless revisions.",
                "In addition to my novel, I share my thoughts and emotions through short stories and poetry on Instagram. My writings often delve into life's intricacies, offering readers a glimpse into my observations and reflections on the world around us. Each piece is a part of me, and I take great joy in connecting with readers through my words."
            ],
            "icon": "fa-solid fa-pen-clip",
            "images": [
                "hobby1.jpg"
            ]
        },

        {
            "name": "Reading",
            "description": [
                "Reading is more than a hobby. It's a journey guided by instinct and curiosity. I'm drawn to the profound insights of non-fiction, exploring history and science, as well as the enchanting tales of mythology that reveal timeless truths. Alongside these, I find solace and wisdom in psychology books like \"Thinking, Fast and Slow,\" unraveling the complexities of human behavior.",
                "The Bhagavad Gita has profoundly influenced my worldview, offering timeless lessons on duty, ethics, and spiritual growth. Additionally, texts like \"The Art of War\" teach invaluable lessons in strategy, resilience, and adaptation. These are the lessons that resonate deeply and guide me in navigating life's challenges with purpose and clarity."
            ],
            "icon": "fa-solid fa-book-open"
        },

        {
            "name": "Music",
            "description": [
                "Music is a profound part of my life, blending the rich melodies of both Indian and Western traditions. Among the countless artists, Jagjit Singh stands out as my all-time favorite, his soulful voice and poetic lyrics deeply resonating with me.",
                "I express my passion for music through playing the guitar, a skill that has allowed me to connect with melodies and rhythms in a personal way. Whether strumming along to classics or experimenting with new tunes, playing the guitar is both a creative outlet and a source of joy.",
                "Ghazals, with their lyrical beauty and emotional depth, hold a special place in my heart. They evoke a range of feelings and offer a profound musical experience that transcends words alone.",
                "Music, in all its forms, enriches my life, offering solace, inspiration, and a means of self-expression that connects me with others on a deeper level."
            ],
            "icon": "fa-solid fa-headphones"
        },

        {
            "name": "Trivia",
            "description": "Trivia is more than a hobby - it's a delightful journey through the realms of history, science, literature, and pop culture. I thrive on discovering and sharing obscure facts and details, whether it's through quizzes, games, or casual conversations. Engaging with trivia not only sharpens my knowledge but also connects me with like-minded enthusiasts who enjoy exploring the fascinating minutiae of the world around us. It's a passion that keeps me constantly curious and eager to uncover new insights.",
            "icon": "fa-solid fa-clipboard-question"
        }
    ]
}